Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/evidence/unlawfully_obtained_evidence.html.txt.tmx
Source language: en
Languages: ga

source: The Irish Constitution guarantees the people of Ireland certain fundamental rights
ga: Bronann Bunreacht na hÉireann cearta bunúsacha ar phobal na hÉireann

source: Sometimes, the Gardai or the prosecution in a case can obtain evidence for a trial in breach of your fundamental rights
ga: In amanna, is féidir leis na Gardaí nó leis na cúisitheoirí i gcás fianaise a fháil ar bhealach a sháraíonn do chearta bunúsacha

source: This means that the evidence has been got in circumstances where your constitutional rights have not been respected
ga: Sa chás sin tá fianaise faighte acu i gcúinsí nach raibh omós tugtha do na cearta bunreachtúla atá agat

source: It has been held by the courts that evidence obtained in "deliberate and conscious" breach of your constitutional rights is inadmissible
ga: Rialaigh na cúirteanna nach bhfuil fianaise a fritheadh ar bhealach a sháraigh "d'aonturas agus go fiosach" do chearta bunreachtúla ceadaithe

source: "Deliberate and conscious" does not mean "intentionally" or "maliciously"
ga: Ní ionann "d'aonturas agus go fiosach" agus "beartaithe" nó "go mailíseach"

source: It can include a situation where the breach of your constitutional rights was an inadvertent mistake
ga: D'fhéadfadh sé gur sáraíodh do chearta bunreachtúla mar bhotún gan cuimhneamh

source: An example of evidence obtained in breach of your constitutional rights would be evidence found in your dwelling by the Gardai without a search warrant
ga: Mar shampla bheadh fianaise a fuair Gardaí i d'áit chónaithe gan barántas cuardaithe a bheith ina seilbh ina sárú ar do chearta bunreachtúla

source: This is a breach of your constitutional right not to have your dwelling violated without your consent except in accordance with law
ga: Is sárú é seo ar do cheart bunreachtúil gan sárú a dhéanamh ar d'áit chónaithe gan do chead ach amháin de réir an dlí

source: Evidence obtained on foot on an unlawful arrest or detention is also inadmissible
ga: Fianaise neamhcheadaithe í fianaise a fuarthas de bharr gabhála nó coinneála a bhí neamhdhleathach

source: In some situations, evidence may be obtained in breach of legislation rather than in breach of the Constitution
ga: In amanna, d'fhéadfadh sé go raibh fianaise faighte ar bhealach a sháraigh an reachtaíocht seachas an Bunreacht

source: For example, you have no constitutional right to be told that you have a right to see a solicitor while you are in detention
ga: Mar shampla, níl aon cheart bunreachtúil agat é a bheith curtha in iúl duit go bhfuil sé de cheart agat dlíodóir a fheiceáil nuair atá tú dhá choinneáil

source: However, the Criminal Justice Acts do require that your right to legal access be brought to your attention
ga: Ach faoi na hAchtanna um Dlí Choiriúil tá sé leagtha síos gur ceart tú a chur ar an eolas go bhfuil sé de cheart agat ionadaíocht dlíthiúil a bheith agat

source: If you are not told about your right to see a solicitor and you then make a statement to the police, that evidence is not automatically inadmissible
ga: Muna n-insítear duit go bhfuil sé de cheart agat dlíodóir a fheiceáil agus má dhéanann tú ráiteas do na Gardaí ní gá go mbeadh an fhianaise sin neamhcheadaithe

source: It is up to the judge to decide whether or not to allow it to be introduced as evidence
ga: Tá sé suas chuig an mbreitheamh cinneadh a dhéanamh an féidir an fhianaise sin a tharraingt anuas

source: For more detailed information you should seek legal advice
ga: Ba chóir duit comhairle dlí a lorg chun faisnéis mionsonraithe a fháil
